app/Controllers/Main.php

    public function index()
    {
        // echo "Hello World!";
        $model_usuarios = new UsuariosModel();
        $usuarios = $model_usuarios->findAll();

        // dd($usuarios);
        echo 'pre';
        print_r($usuarios);

        $model_tasks = new TasksModel();
        $tasks = $model_tasks->findAll();
---
SELECT *
FROM `usuarios`
SELECT *
FROM `tasks`