app/Controllers/Main.php

    public function index()
    {
       // main page
       $data =[];

       //load tasks from the database and the user in session
       $tasks_model = new TasksModel();
       $data['tasks'] = $tasks_model->where('id_user', session()->id)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '1'

       $senha =$this->request->getPost('text_senha');

       $usuarios_model = new UsuariosModel();
       $usuario_data = $usuarios_model->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'Maria'
 LIMIT 1

    public function search ()
    {
        $data =[];

        //get search items
        $search_term = $this->request->getPost('text_search');

        //load tasks from database and the search term
        $tasks_model = new TasksModel();
        $data['tasks'] = $tasks_model->where('id_user', session()->id)->like('task_name', $search_term)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '1'
AND  `task_name` LIKE '%Ati%' ESCAPE '!'

    public function task_details($enc_id)
    {
        //decrypt task id
        $task_id = decrypt($enc_id);
        if(!$task_id){
            return redirect()->to('/');
        }

        //load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '9'
 LIMIT 1